--[[
  ░█████╗░██████╗░███████╗░█████╗░████████╗██╗██╗░░░██╗██╗████████╗██╗░░░██╗
  ██╔══██╗██╔══██╗██╔════╝██╔══██╗╚══██╔══╝██║██║░░░██║██║╚══██╔══╝╚██╗░██╔╝
  ██║░░╚═╝██████╔╝█████╗░░███████║░░░██║░░░██║╚██╗░██╔╝██║░░░██║░░░░╚████╔╝░
  ██║░░██╗██╔══██╗██╔══╝░░██╔══██║░░░██║░░░██║░╚████╔╝░██║░░░██║░░░░░╚██╔╝░░
  ╚█████╔╝██║░░██║███████╗██║░░██║░░░██║░░░██║░░╚██╔╝░░██║░░░██║░░░░░░██║░░░
  ░╚════╝░╚═╝░░╚═╝╚══════╝╚═╝░░╚═╝░░░╚═╝░░░╚═╝░░░╚═╝░░░╚═╝░░░╚═╝░░░░░░╚═╝░░░                                                           


███╗░░░███╗░█████╗░██╗░░██╗░█████╗░███╗░░░███╗███████╗██████╗░  ░██████╗░█████╗░██╗░░░░░███████╗███╗░░░███╗
████╗░████║██╔══██╗██║░░██║██╔══██╗████╗░████║██╔════╝██╔══██╗  ██╔════╝██╔══██╗██║░░░░░██╔════╝████╗░████║
██╔████╔██║██║░░██║███████║███████║██╔████╔██║█████╗░░██║░░██║  ╚█████╗░███████║██║░░░░░█████╗░░██╔████╔██║
██║╚██╔╝██║██║░░██║██╔══██║██╔══██║██║╚██╔╝██║██╔══╝░░██║░░██║  ░╚═══██╗██╔══██║██║░░░░░██╔══╝░░██║╚██╔╝██║
██║░╚═╝░██║╚█████╔╝██║░░██║██║░░██║██║░╚═╝░██║███████╗██████╔╝  ██████╔╝██║░░██║███████╗███████╗██║░╚═╝░██║
╚═╝░░░░░╚═╝░╚════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═╝░░░░░╚═╝╚══════╝╚═════╝░  ╚═════╝░╚═╝░░╚═╝╚══════╝╚══════╝╚═╝░░░░░╚═╝
]]--

CMcc = {}
--[# طريقة التركيب؟ ]
--[# و عدل الكونفق و مبروك server.cfgاكتب هذا الكلام في الـ ]
--[# ensure CM_CarControl ]
--[# اهم الاعدادات ]
CMcc.Settings = {
  License = ""; --[# رخصتك الي تجي مع الملف ]
  Permission = ""; --[# برمشن السكربت ]
  Command = ""; --[# كواماند فتح القائمة ]
  TopLevel = -0.33; --[# أعلى حد لرفع السيارة ]
  MinimumLevel = 0.1; --[# أدنى حد للأنزال ]  
  TextLevel = "~w~: ﺓﺭﺎﻴﺴﻟﺍ ﻯﻮﺘﺴﻣ"; --[# T-الكتابة حقت مستوى السيارة - الزم تكون معكوسـ ]
  TextC = "~w~"; --[# لون الارقام - مستوى ]  
  NotifyCr = "🚗 يجب أن تكون داخل سيارة"; --[# H-الكتابة الي تجي يوم يفتح القائمة و هو برا سيار ] 
  NotifyTL = "🚗 لا يمكنك رفع السيارة أكثر من هذا الحد"; --[# 3-الكتابة الي تجي يوم توصل أقصى حد للرفـ ] 
  NotifyML = "🚗 لا يمكنك أنزال السيارة أقل من هذا الحد"; --[# 3-الكتابة الي تجي يوم توصل أدنى حد للرفـ ] 
  Img = "" --[# صورة السيرفر ]
};
--[# أعدادات الجوال ]
CMcc.Phone = {
  MenuN = "!-أعدادات تحكم السيارة-!"; --[# T-اسم القائمة الخارجيـ ]
  MenuP = "main"; --[# مكان القائمة - main = القائمة الرئسية - admin = قائمة الادمن - police = قائمة الشرطة ]
  MenuOp = "- فتح القائمة -"; --[# Y-اسم القامة الثانـ ]
  MenuDes = "فتح قائمة رفع و أنزال السيارة" --[# F-الكلام الي يجي جنب القامة - وصـ ]
};
--[# حالة الأضافات ]
--[# في حال تبي تشغل او تطفي اي ميزة في السكربت من هنا ]
--[# حالة الأضافات - true = تشغيل - false = ايقاف ] 
CMcc.Condition = {
  Level = true; --[# الكتابة الي تبين مستوي السيارة ] 
  Phone = true; --[# فتح قائة التعديل من الجوال ] 
  Key = true; --[# فتح القائمة من الأختصارات ] 
  Command = true --[# فتح قائمة التعديل من الكوماند الي بل شات ] 
};
--[# أعدادات النوتيفاي ]
--[# فقط غير التريقر بحق ملفاتك ]
--[# pNotify أو خل هذا اذا مركب ]
function CMccNotify(player , msg)
  TriggerEvent("pNotify:SendNotification",{
    text = "<span style='color:white;text-align: center;font-weight: 900'><h1><img src="..CMcc.Settings.Img.." width='90' height='90'><br/><h2> "..msg.."</style></font>",
    type = "info",
    timeout = (10*1000),
    layout = "centerleft",
  })
end
--[# اعدادات التحكم ]
--[# في حال تبي زر واحد خل الزر الاول 0 و الثاني الي تبيه ]
--[# اكواد حميع الازرار ]
--["ESC"] = 322, ["F1"] = 288, ["F2"] = 289, ["F3"] = 170, ["F5"] = 166, ["F6"] = 167, ["F7"] = 168, ["F8"] = 169, d["F9"] = 56, ["F10"] = 57,
--["~"] = 243, ["1"] = 157, ["2"] = 158, ["3"] = 160, ["4"] = 164, ["5"] = 165, ["6"] = 159, ["7"] = 161, ["8"] = 162, ["9"] = 163
--["TAB"] = 37, ["Q"] = 44, ["W"] = 32, ["E"] = 38, ["R"] = 45, ["T"] = 245, ["Y"] = 246, ["U"] = 303, ["P"] = 199, ["["] = 39, 
--["CAPS"] = 137, ["A"] = 34, ["S"] = 8, ["D"] = 9, ["F"] = 23, ["G"] = 47, ["H"] = 74, ["K"] = 311, ["L"] = 182, ["ENTER"] = 18,
--["LEFTSHIFT"] = 21, ["Z"] = 20, ["X"] = 73, ["C"] = 26, ["V"] = 0, ["B"] = 29, ["N"] = 249, ["M"] = 244, [","] = 82, ["."] = 81,
--["LEFTCTRL"] = 36, ["LEFTALT"] = 19, ["SPACE"] = 22, ["RIGHTCTRL"] = 70, ["="] = 83, ["BACKSPACE"] = 177, ["N9"] = 118 , ["N8"] = 61,
--["HOME"] = 213, ["PAGEUP"] = 10, ["PAGEDOWN"] = 11, ["DELETE"] = 178, ["TOP"] = 27, ["DOWN"] = 173, ["N-"] = 97, ["N7"] = 117,
--["LEFT"] = 174, ["RIGHT"] = 175, ["NENTER"] = 201, ["N4"] = 108, ["N5"] = 60, ["N6"] = 107, ["N+"] = 96, ["-"] = 84, ["]"] = 40, 
CMcc.Control = {
  Key1 = 0; --[# الزر الاول ]
  Key2 = 303 --[# الزر الثاني ]
};

return CMcc

--[[
  ░█████╗░██████╗░███████╗░█████╗░████████╗██╗██╗░░░██╗██╗████████╗██╗░░░██╗
  ██╔══██╗██╔══██╗██╔════╝██╔══██╗╚══██╔══╝██║██║░░░██║██║╚══██╔══╝╚██╗░██╔╝
  ██║░░╚═╝██████╔╝█████╗░░███████║░░░██║░░░██║╚██╗░██╔╝██║░░░██║░░░░╚████╔╝░
  ██║░░██╗██╔══██╗██╔══╝░░██╔══██║░░░██║░░░██║░╚████╔╝░██║░░░██║░░░░░╚██╔╝░░
  ╚█████╔╝██║░░██║███████╗██║░░██║░░░██║░░░██║░░╚██╔╝░░██║░░░██║░░░░░░██║░░░
  ░╚════╝░╚═╝░░╚═╝╚══════╝╚═╝░░╚═╝░░░╚═╝░░░╚═╝░░░╚═╝░░░╚═╝░░░╚═╝░░░░░░╚═╝░░░                                                           


███╗░░░███╗░█████╗░██╗░░██╗░█████╗░███╗░░░███╗███████╗██████╗░  ░██████╗░█████╗░██╗░░░░░███████╗███╗░░░███╗
████╗░████║██╔══██╗██║░░██║██╔══██╗████╗░████║██╔════╝██╔══██╗  ██╔════╝██╔══██╗██║░░░░░██╔════╝████╗░████║
██╔████╔██║██║░░██║███████║███████║██╔████╔██║█████╗░░██║░░██║  ╚█████╗░███████║██║░░░░░█████╗░░██╔████╔██║
██║╚██╔╝██║██║░░██║██╔══██║██╔══██║██║╚██╔╝██║██╔══╝░░██║░░██║  ░╚═══██╗██╔══██║██║░░░░░██╔══╝░░██║╚██╔╝██║
██║░╚═╝░██║╚█████╔╝██║░░██║██║░░██║██║░╚═╝░██║███████╗██████╔╝  ██████╔╝██║░░██║███████╗███████╗██║░╚═╝░██║
╚═╝░░░░░╚═╝░╚════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═╝░░░░░╚═╝╚══════╝╚═════╝░  ╚═════╝░╚═╝░░╚═╝╚══════╝╚══════╝╚═╝░░░░░╚═╝
]]--